In [1]:
from pyspark.sql import SparkSession
from pyspark.sql.functions import *
from pyspark.sql.types import *

In [2]:
# construct spark session
spark = SparkSession.builder.appName("test").getOrCreate()

22/05/08 22:07:58 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable
Using Spark's default log4j profile: org/apache/spark/log4j-defaults.properties
Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
22/05/08 22:07:59 WARN Utils: Service 'SparkUI' could not bind on port 4040. Attempting port 4041.
22/05/08 22:07:59 WARN Utils: Service 'SparkUI' could not bind on port 4041. Attempting port 4042.

## Load data

###  Load Visa Dimension Table

In [3]:
# load parquet data
visa_dim = spark.read.parquet("tables/visa_dim.parquet")

In [4]:
visa_dim.select("*").toPandas()

   visa_category_id visa_category_name
0                 1           Business
1                 2           Pleasure
2                 3            Student

### Load Country Dimension Table

In [5]:
# load parquet data
country_dim = spark.read.parquet("tables/country_dim.parquet")

In [6]:
country_dim.select("*").toPandas()

     country_id              country_name
0           527  TURKS AND CAICOS ISLANDS
1           420                    TUVALU
2           352                    UGANDA
3           162                   UKRAINE
4           296      UNITED ARAB EMIRATES
..          ...                       ...
284         299                  MONGOLIA
285         735                MONTENEGRO
286         521                MONTSERRAT
287         332                   MOROCCO
288         329                MOZAMBIQUE

[289 rows x 2 columns]

### Load Ports Dimension Table

In [42]:
# load parquet data
ports_dim = spark.read.parquet("tables_/ports_dim.parquet")

In [43]:
ports_dim.select("*").toPandas()

    port_id           port_name
0       NEA        NEAH BAY, WA
1       NIG       NIGHTHAWK, WA
2       OLY         OLYMPIA, WA
3       ORO        OROVILLE, WA
4       PWB           PASCO, WA
..      ...                 ...
655     ADU  No PORT Code (ADU)
656     AKT  No PORT Code (AKT)
657     LIT  No PORT Code (LIT)
658     A2A  No PORT Code (A2A)
659     OSN  No PORT Code (OSN)

[660 rows x 2 columns]

### Load Immigration Fact Table

In [35]:
# Load parquet data
immigration_fact = spark.read.parquet("tables_/immigration_fact.parquet/visa_category=1")

In [36]:
immigration_fact.select("*").toPandas().head()

,record_id,entry_year,entry_month,country_citizenship,country_residence,port_of_entry,arrival_date,mode_of_entry,state_code,departure_date,...,count,arrival_flag,departure_flag,match_flag,birth_year,gender,airline,admission_number,flight_number,visa_type
0,1818146,2016,4,148,112,ATL,2016-04-10,1.0,SC,2016-04-20,...,1,G,O,M,1986.0,M,DL,2147483647,00131,WB
1,2055217,2016,4,438,438,NYC,2016-04-11,1.0,HN,2016-04-16,...,1,O,O,M,1957.0,None,JQ,2147483647,00003,WB
2,1818149,2016,4,148,112,ATL,2016-04-10,1.0,SC,2016-04-22,...,1,G,O,M,1988.0,M,DL,2147483647,00131,WB
3,2055223,2016,4,438,438,CHI,2016-04-11,1.0,DC,2016-04-16,...,1,O,O,M,1952.0,None,AF,2147483647,00054,WB
4,1818150,2016,4,148,112,ATL,2016-04-10,1.0,SC,2016-04-13,...,1,O,O,M,1982.0,None,LH,2147483647,00444,WB

In [37]:
immigration_fact.printSchema()

root
 |-- record_id: integer (nullable = true)
 |-- entry_year: integer (nullable = true)
 |-- entry_month: integer (nullable = true)
 |-- country_citizenship: integer (nullable = true)
 |-- country_residence: integer (nullable = true)
 |-- port_of_entry: string (nullable = true)
 |-- arrival_date: string (nullable = true)
 |-- mode_of_entry: integer (nullable = true)
 |-- state_code: string (nullable = true)
 |-- departure_date: string (nullable = true)
 |-- age: integer (nullable = true)
 |-- count: integer (nullable = true)
 |-- arrival_flag: string (nullable = true)
 |-- departure_flag: string (nullable = true)
 |-- match_flag: string (nullable = true)
 |-- birth_year: integer (nullable = true)
 |-- gender: string (nullable = true)
 |-- airline: string (nullable = true)
 |-- admission_number: integer (nullable = true)
 |-- flight_number: string (nullable = true)
 |-- visa_type: string (nullable = true)

### Load Calendar dim table

In [21]:
# Load parquet data
calendar_dim = spark.read.parquet("tables_/calendar_dim.parquet")

In [22]:
calendar_dim.select("*").toPandas()

,calendar_date,arrival_day,arrival_week,arrival_month,arrival_year,arrival_weekday,calendar_id
0,2016-08-02,2.0,31.0,8.0,2016.0,3.0,2430951489536
1,2016-05-18,18.0,20.0,5.0,2016.0,4.0,2430951489537
2,2016-09-06,6.0,36.0,9.0,2016.0,3.0,2430951489538
3,2016-08-16,16.0,33.0,8.0,2016.0,3.0,2430951489539
4,2016-02-05,5.0,5.0,2.0,2016.0,6.0,2430951489540
...,...,...,...,...,...,...,...
261,2015-12-21,21.0,52.0,12.0,2015.0,2.0,3126736191489
262,2016-07-01,1.0,26.0,7.0,2016.0,6.0,2954937499648
263,2014-04-24,24.0,17.0,4.0,2014.0,5.0,2954937499649
264,2016-07-15,15.0,28.0,7.0,2016.0,6.0,2138893713408
265,2015-05-30,30.0,22.0,5.0,2015.0,7.0,2138893713409

### Load Demographic dim table

In [27]:
# Load parquet data
demographic_dim = spark.read.parquet("tables_/demographics_dim.parquet")

In [28]:
demographic_dim.select("*").toPandas()

,city,state,median_age,male_population,female_population,total_population,number_veterans,foreign_born,average_household_size,state_code,race,count
0,Silver Spring,Maryland,33.8,40601.0,41862.0,82463,1562.0,30908.0,2.60,MD,Hispanic or Latino,25924
1,Quincy,Massachusetts,41.0,44129.0,49500.0,93629,4147.0,32935.0,2.39,MA,White,58723
2,Hoover,Alabama,38.5,38040.0,46799.0,84839,4819.0,8229.0,2.58,AL,Asian,4759
3,Rancho Cucamonga,California,34.5,88127.0,87105.0,175232,5821.0,33878.0,3.18,CA,Black or African-American,24437
4,Newark,New Jersey,34.6,138040.0,143873.0,281913,5829.0,86253.0,2.73,NJ,White,76402
...,...,...,...,...,...,...,...,...,...,...,...,...
2886,Stockton,California,32.5,150976.0,154674.0,305650,12822.0,79583.0,3.16,CA,American Indian and Alaska Native,19834
2887,Southfield,Michigan,41.6,31369.0,41808.0,73177,4035.0,4011.0,2.27,MI,American Indian and Alaska Native,983
2888,Indianapolis,Indiana,34.1,410615.0,437808.0,848423,42186.0,72456.0,2.53,IN,White,553665
2889,Somerville,Massachusetts,31.0,41028.0,39306.0,80334,2103.0,22292.0,2.43,MA,American Indian and Alaska Native,374
2890,Coral Springs,Florida,37.2,63316.0,66186.0,129502,4724.0,38552.0,3.17,FL,White,90896

### Load US states dim table

In [38]:
# Load parquet data
us_states_dim = spark.read.parquet("tables_/us_states_dim.parquet")

In [39]:
us_states_dim.select("*").toPandas()

   us_state_id      us_state_name
0           KY           KENTUCKY
1           LA          LOUISIANA
2           ME              MAINE
3           MD           MARYLAND
4           MA      MASSACHUSETTS
5           MI           MICHIGAN
6           MN          MINNESOTA
7           MS        MISSISSIPPI
8           MO           MISSOURI
9           MT            MONTANA
10          NC        N. CAROLINA
11          ND          N. DAKOTA
12          VI     VIRGIN ISLANDS
13          VA           VIRGINIA
14          WV        W. VIRGINIA
15          WA         WASHINGTON
16          WI          WISCONSON
17          WY            WYOMING
18          99    All Other Codes
19          CT        CONNECTICUT
20          DE           DELAWARE
21          DC  DIST. OF COLUMBIA
22          FL            FLORIDA
23          GA            GEORGIA
24          GU               GUAM
25          OH               OHIO
26          OK           OKLAHOMA
27          OR             OREGON
28          PA       PENNSYLVANIA
29          PR        PUERTO RICO
30          RI       RHODE ISLAND
31          SC        S. CAROLINA
32          SD          S. DAKOTA
33          TN          TENNESSEE
34          TX              TEXAS
35          UT               UTAH
36          VT            VERMONT
37          NE           NEBRASKA
38          NV             NEVADA
39          NH      NEW HAMPSHIRE
40          NJ         NEW JERSEY
41          NM         NEW MEXICO
42          NY           NEW YORK
43          AL            ALABAMA
44          AK             ALASKA
45          AZ            ARIZONA
46          AR           ARKANSAS
47          CA         CALIFORNIA
48          CO           COLORADO
49          HI             HAWAII
50          ID              IDAHO
51          IL           ILLINOIS
52          IN            INDIANA
53          IA               IOWA
54          KS             KANSAS

### Load US airports dim table

In [40]:
# Load parquet data
us_airports_dim = spark.read.parquet("tables_/us_airports_dim.parquet")

In [41]:
us_airports_dim.select("*").toPandas()

,ident,type,name,elevation_ft,continent,iso_country,municipality,gps_code,iata_code,local_code,coordinates,state_code
0,07FA,small_airport,Ocean Reef Club Airport,8.0,NA,US,Key Largo,07FA,OCA,07FA,"-80.274803161621, 25.325399398804",FL
1,0AK,small_airport,Pilot Station Airport,305.0,NA,US,Pilot Station,None,PQS,0AK,"-162.899994, 61.934601",AK
2,0CO2,small_airport,Crested Butte Airpark,8980.0,NA,US,Crested Butte,0CO2,CSE,0CO2,"-106.928341, 38.851918",CO
3,0TE7,small_airport,LBJ Ranch Airport,1515.0,NA,US,Johnson City,0TE7,JCY,0TE7,"-98.62249755859999, 30.251800537100003",TX
4,13MA,small_airport,Metropolitan Airport,418.0,NA,US,Palmer,13MA,PMX,13MA,"-72.31140136719999, 42.223300933800004",MA
...,...,...,...,...,...,...,...,...,...,...,...,...
2026,Z71,seaplane_base,Cape Pole Seaplane Base,0.0,NA,US,Cape Pole,Z71,CZP,Z71,"-133.79699707, 55.9663009644",AK
2027,Z78,seaplane_base,Chignik Bay Seaplane Base,NaN,NA,US,Chignik,Z78,KBW,Z78,"-158.401000977, 56.295600891099994",AK
2028,Z91,small_airport,Birch Creek Airport,450.0,NA,US,Birch Creek,Z91,KBC,Z91,"-145.824005127, 66.2740020752",AK
2029,Z93,small_airport,Copper Center 2 Airport,1150.0,NA,US,Copper Center,Z93,CZC,Z93,"-145.294006348, 61.9412002563",AK
2030,ZNC,small_airport,Nyac Airport,460.0,NA,US,Nyac,ZNC,ZNC,ZNC,"-159.994003296, 60.9807014465",AK